RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/drivers/fsl_powerquad_cmsis.c
    switch (N)
    {
        /* Initialize the table modifier values */
        case 512U:
            S->pTwiddle   = dct512_twiddle;
            S->pCosFactor = dct512_cosFactor;
            break;

        case 256U:
            S->pTwiddle   = dct256_twiddle;
            S->pCosFactor = dct256_cosFactor;
            break;

        case 128U:
            S->pTwiddle   = dct128_twiddle;
            S->pCosFactor = dct128_cosFactor;
            break;

        case 64U:
            S->pTwiddle   = dct64_twiddle;
            S->pCosFactor = dct64_cosFactor;
            break;

        case 32U:
            S->pTwiddle   = dct32_twiddle;
            S->pCosFactor = dct32_cosFactor;
            break;

        case 16U:
            S->pTwiddle   = dct16_twiddle;
            S->pCosFactor = dct16_cosFactor;
            break;

        default:
            status = ARM_MATH_ARGUMENT_ERROR;
            break;
    }

    if (ARM_MATH_SUCCESS == status)
    {
        /* Initialize the RFFT/RIFFT Function */
        status = arm_rfft_init_q31(S->pRfft, S->N, 0, 1);
    }

    return status;
}

void arm_dct4_q31(const arm_dct4_instance_q31 *S, q31_t *pState, q31_t *pInlineBuffer)
{
    /* Calculate DCT-II for N-point input */
    uint16_t i;           /* Loop counter */
    const q31_t *weights; /* Pointer to the Weights table */
    q31_t *pOut;          /* Temporary pointers for output buffer */
    q31_t *pS1, *pbuff;   /* Temporary pointers for input buffer and pState buffer */
    q31_t in;             /* Temporary variable */
    const q31_t *cosFact;
    uint32_t length;
    uint8_t matRow;
    uint8_t matCol;
    uint8_t matLoop;
    uint16_t lenPerMatLoop;

    /*
     * Pre-processing involves multiplying input with cos factor,
     *     r(n) = 2 * u(n) * cos(pi*(2*n+1)/(4*N))
     *              where,
     *                 r(n) -- output of preprocessing
     *                 u(n) -- input to preprocessing(actual Source buffer)
     */

    /*
     * Use matrix production function for preprocessing. Matrix production
     * supports 16x16 at the most, so the matrix row is set to 16.
     */
    matRow        = 16U;
    lenPerMatLoop = S->N >= 256U ? 256U : S->N;
    matCol        = (uint8_t)(lenPerMatLoop / 16U);
    matLoop       = (uint8_t)(((S->N - 1U) >> 8U) + 1U);
    cosFact       = S->pCosFactor;
    pbuff         = pInlineBuffer;

    length = POWERQUAD_MAKE_MATRIX_LEN(matRow, matCol, matCol);

    while ((matLoop--) != 0U)
    {
        PQ_SET_MAT_FIX32_WORKAROUND_SCALE_CONFIG;

        /* cos factor is Q31, convert to float */
        PQ_MatrixScale(POWERQUAD, length, 2.0f / 2147483648.0f, cosFact, (void *)(uint32_t *)0xE0000000U);
        cosFact = &cosFact[lenPerMatLoop];

        PQ_WaitDone(POWERQUAD);

        /* Product. */
        PQ_SET_MAT_FIX32_WORKAROUND_MULT_CONFIG;

        PQ_MatrixProduct(POWERQUAD, length, pbuff, (void *)(uint32_t *)0xE0000000U, pbuff);

        pbuff = &pbuff[lenPerMatLoop];

        PQ_WaitDone(POWERQUAD);
    }

    PQ_SET_FFT_Q31_CONFIG;

    PQ_TransformRDCT(POWERQUAD, S->N, pInlineBuffer, pState);

    /* ARM calculation while PQ is running. */
    /*
     * Use matrix production function for twiddle multiplication.
     * Matrix production supports 16x16 at the most. The total elements are 2*N;
     */
    lenPerMatLoop = S->N >= 128U ? 128U : S->N;
    matCol        = (uint8_t)(lenPerMatLoop / 8U);
    matLoop       = (uint8_t)(((S->N - 1U) >> 7U) + 1U);
    weights       = S->pTwiddle;
    pOut          = pState;

    length = POWERQUAD_MAKE_MATRIX_LEN(matRow, matCol, matCol);

    PQ_WaitDone(POWERQUAD);

    while ((matLoop--) != 0U)
    {
        PQ_SET_MAT_FIX32_WORKAROUND_SCALE_CONFIG;

        /* Downscale by 1024 * 1024 * 16, because the twiddle are multiplied by 1024 * 1024 * 16. */
        PQ_MatrixScale(POWERQUAD, length, 1.0f / 16777216.0f, weights, (void *)(uint32_t *)0xE0000000U);
        weights = &weights[lenPerMatLoop * 2U];

        PQ_WaitDone(POWERQUAD);

        /* Product. */
        PQ_SET_MAT_FIX32_WORKAROUND_MULT_CONFIG;

        PQ_MatrixProduct(POWERQUAD, length, pOut, (void *)(uint32_t *)0xE0000000U, pOut);

        PQ_WaitDone(POWERQUAD);

        for (i = 0; i < lenPerMatLoop / 4U; i++)
        {
            pOut[0] -= pOut[1];
            pOut = &pOut[2];
            pOut[0] -= pOut[1];
            pOut = &pOut[2];
            pOut[0] -= pOut[1];
            pOut = &pOut[2];
            pOut[0] -= pOut[1];
            pOut = &pOut[2];
        }
    }

    /* ----------- Post-processing ---------- */
    /* DCT-IV can be obtained from DCT-II by the equation,
     *       Y4(k) = Y2(k) - Y4(k-1) and Y4(-1) = Y4(0)
     *       Hence, Y4(0) = Y2(0)/2  */
    /* Getting only real part from the output and Converting to DCT-IV */

    /* pbuff initialized to input buffer. */
    pbuff = pInlineBuffer;

    /* pS1 initialized to pState */
    pS1 = pState;

    /* Calculating Y4(0) from Y2(0) using Y4(0) = Y2(0)/2. Considering the DCT II normalize, here divided by sqrt(2).*/
    in       = (q31_t)(float)((float)*pS1 / 1.41421356237f);
    *pbuff++ = in;
    pS1      = &pS1[2];

    in       = *pS1 - in;
    *pbuff++ = in;
    pS1      = &pS1[2];

    in       = *pS1 - in;
    *pbuff++ = in;
    pS1      = &pS1[2];

    in       = *pS1 - in;
    *pbuff++ = in;
    pS1      = &pS1[2];

    i = S->N / 4U - 1U;

    while (i > 0U)
    {
        in       = *pS1 - in;
        *pbuff++ = in;
        pS1      = &pS1[2];

        in       = *pS1 - in;
        *pbuff++ = in;
        pS1      = &pS1[2];

        in       = *pS1 - in;
        *pbuff++ = in;
        pS1      = &pS1[2];

        in       = *pS1 - in;
        *pbuff++ = in;
        pS1      = &pS1[2];

        i--;
    }
}

arm_status arm_dct4_init_q15(arm_dct4_instance_q15 *S,
                             arm_rfft_instance_q15 *S_RFFT,
                             arm_cfft_radix4_instance_q15 *S_CFFT,
                             uint16_t N,
                             uint16_t Nby2,
                             q15_t normalize)
{
    arm_status status = ARM_MATH_SUCCESS;

    /* Initialize the DCT4 length */
    S->N = N;

    /* Initialize Real FFT Instance */
    S->pRfft = S_RFFT;

