RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/drivers/fsl_powerquad_cmsis.c
        status = ARM_MATH_SUCCESS;
    }

    /* Return to application */
    return status;
}

arm_status arm_mat_scale_q15(const arm_matrix_instance_q15 *pSrc,
                             q15_t scaleFract,
                             int32_t shift,
                             arm_matrix_instance_q15 *pDst)
{
    assert(NULL != pSrc);
    assert(NULL != pDst);

    arm_status status;
    uint32_t length;
    float scaleFloat;

    pq_config_t config = {
        kPQ_16Bit,               /* inputAFormat   */
        0,                       /* inputAPrescale */
        kPQ_16Bit,               /* inputBFormat   */
        0,                       /* inputBPrescale */
        kPQ_16Bit,               /* outputFormat   */
        (int8_t)shift,           /* outputPrescale */
        kPQ_Float,               /* tmpFormat      */
        0,                       /* tmpPrescale    */
        kPQ_Float,               /* machineFormat  */
        (uint32_t *)0xe0000000U, /* tmpBase        */
    };

#ifdef ARM_MATH_MATRIX_CHECK
    /* Check for matrix mismatch condition */
    if ((pSrc->numRows != pSrc->numCols) || (pDst->numRows != pDst->numCols) || (pSrc->numRows != pDst->numRows))
    {
        /* Set status as ARM_MATH_SIZE_MISMATCH */
        status = ARM_MATH_SIZE_MISMATCH;
    }
    else
#endif
    {
        length = POWERQUAD_MAKE_MATRIX_LEN(pSrc->numRows, pSrc->numCols, 0U);

        scaleFloat = PQ_Q15_2_FLOAT(scaleFract);

        PQ_SetConfig(POWERQUAD, &config);

        PQ_MatrixScale(POWERQUAD, length, scaleFloat, pSrc->pData, pDst->pData);

        /* Wait for the completion */
        PQ_WaitDone(POWERQUAD);

        status = ARM_MATH_SUCCESS;
    }

    /* Return to application */
    return status;
}
